IdeaRS.Connections
EndPlateOnFlangesData.BeamPlateSize Property
Compatible with IDEA StatiCa 0.0
 Indicates, whether second end plate has different dimensions. If Default is set, beam plate is identical as endplate on flanges. It is used only if bolted connections.
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public PlateSizeMethodTypes BeamPlateSize { get; set; }
Property Value
Type: PlateSizeMethodTypes
See Also
Reference
EndPlateOnFlangesData Class
IdeaRS.Connections.Data Namespace